# PenPat

## Description
Deprecated - will generate error. Use PenPatN instead.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE PenPat(patNumber : INTEGER);
```

```python

def vs.PenPat(patNumber):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|patNumber|INTEGER|Pattern/linestyle ID value.|

## Remarks
Deprecated - will generate error. Use PenPatN instead.

## Examples
```pascal
PenPat(25);

{ uses fill pattern 25 as the active pen pattern }

PenPat(-3);

{ sets a linestyle as the active pen pattern }
```

## See Also
VS Functions:
PenPatN

## Version
```diff
- PenPat is obsolete as of Vectorworks 2013
```

Availability: from MiniCAD
## Category
* Document Attributes